mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
/*
 * Google's Firebase Realtime Database Arduino Library for ESP8266, version 1.0.5
 * 
  * April 20, 2019
 * 
 * Feature Added:
 * 
 * Feature Fixed:
 * - Fixed Boolean data type misconception
 * - ESP8266 Arduino Core SDK version check
 *  
 *  
 * 
 * This library provides ESP8266 to perform REST API by GET PUT, POST, PATCH, DELETE data from/to with Google's Firebase database using get, set, update
 * and delete calls. 
 * 
 * The library was test and work well with ESP32s based module and add support for multiple stream event path.
 * 
 * The MIT License (MIT)
 * Copyright (c) 2019 K. Suwatchai (Mobizt)
 * 
 * 
 * Permission is hereby granted, free of charge, to any person returning a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#ifndef FirebaseESP8266_H
#define FirebaseESP8266_H

#include <Arduino.h>
#include <core_version.h>

//ARDUINO_ESP8266_GIT_VER
//2.5.0 0x951aeffa
//2.5.0-beta3 0x21db8fc9
//2.5.0-beta2 0x0fd86a07
//2.5.0-beta1 0x9c1e03a1
//2.4.2 0xbb28d4a3
//2.4.1 0x614f7c32
//2.4.0 0x4ceabea9
//2.4.0-rc2 0x0c897c37
//2.4.0-rc1 0xf6d232f1

#ifndef ARDUINO_ESP8266_GIT_VER
#error Your ESP8266 Arduino Core SDK is outdated, please update. From Arduino IDE go to Boards Manager and search 'esp8266' then select version 2.4.0 or above.
#endif

#if ARDUINO_ESP8266_GIT_VER != 0xf6d232f1 && ARDUINO_ESP8266_GIT_VER != 0x0c897c37 && ARDUINO_ESP8266_GIT_VER != 0x4ceabea9 && ARDUINO_ESP8266_GIT_VER != 0x614f7c32 && ARDUINO_ESP8266_GIT_VER != 0xbb28d4a3
#define USING_AXTLS
#endif


#include <ESP8266WiFi.h>
#include "FirebaseESP8266HTTPClient.h"
#include <SPI.h>
#include <SD.h>

#define FIEBASE_PORT 443
#define FIREBASE_RESPONSE_SIZE 400
#define KEEP_ALIVE_TIMEOUT 30000

#define HTTPC_ERROR_CONNECTION_INUSED -16

#define DEF_ESP8266_FIREBASE_STR_19 "null"
#define DEF_ESP8266_FIREBASE_STR_92 "\"blob,base64,"
#define DEF_ESP8266_FIREBASE_STR_93 "\"file,base64,"
#define DEF_ESP8266_FIREBASE_STR_4 "."
#define DEF_ESP8266_FIREBASE_STR_106 "false"
#define DEF_ESP8266_FIREBASE_STR_107 "true"

static const char ESP8266_FIREBASE_STR_1[] PROGMEM = "/";
static const char ESP8266_FIREBASE_STR_2[] PROGMEM = ".json?auth=";
static const char ESP8266_FIREBASE_STR_3[] PROGMEM = "\"";
static const char ESP8266_FIREBASE_STR_4[] PROGMEM = ".";
static const char ESP8266_FIREBASE_STR_5[] PROGMEM = "HTTP/1.1 ";
static const char ESP8266_FIREBASE_STR_6[] PROGMEM = " ";
static const char ESP8266_FIREBASE_STR_7[] PROGMEM = ":";
static const char ESP8266_FIREBASE_STR_8[] PROGMEM = "Content-Type: ";
static const char ESP8266_FIREBASE_STR_9[] PROGMEM = "text/event-stream";
static const char ESP8266_FIREBASE_STR_10[] PROGMEM = "Connection: ";
static const char ESP8266_FIREBASE_STR_11[] PROGMEM = "keep-alive";
static const char ESP8266_FIREBASE_STR_12[] PROGMEM = "Content-Length: ";
static const char ESP8266_FIREBASE_STR_13[] PROGMEM = "event: ";
static const char ESP8266_FIREBASE_STR_14[] PROGMEM = "data: ";
static const char ESP8266_FIREBASE_STR_15[] PROGMEM = "put";
static const char ESP8266_FIREBASE_STR_16[] PROGMEM = "patch";
static const char ESP8266_FIREBASE_STR_17[] PROGMEM = "\"path\":\"";
static const char ESP8266_FIREBASE_STR_18[] PROGMEM = "\"data\":";
static const char ESP8266_FIREBASE_STR_19[] PROGMEM = "null";
static const char ESP8266_FIREBASE_STR_20[] PROGMEM = "{\"name\":\"";
static const char ESP8266_FIREBASE_STR_21[] PROGMEM = "\r\n";
static const char ESP8266_FIREBASE_STR_22[] PROGMEM = "GET ";
static const char ESP8266_FIREBASE_STR_23[] PROGMEM = "PUT";
static const char ESP8266_FIREBASE_STR_24[] PROGMEM = "POST";
static const char ESP8266_FIREBASE_STR_25[] PROGMEM = "GET";
static const char ESP8266_FIREBASE_STR_26[] PROGMEM = "PATCH";
static const char ESP8266_FIREBASE_STR_27[] PROGMEM = "DELETE";
static const char ESP8266_FIREBASE_STR_28[] PROGMEM = "&download=";
static const char ESP8266_FIREBASE_STR_29[] PROGMEM = "&print=silent";
static const char ESP8266_FIREBASE_STR_30[] PROGMEM = " HTTP/1.1\r\n";
static const char ESP8266_FIREBASE_STR_31[] PROGMEM = "Host: ";
static const char ESP8266_FIREBASE_STR_32[] PROGMEM = "User-Agent: ESP8266\r\n";
static const char ESP8266_FIREBASE_STR_33[] PROGMEM = "X-Firebase-Decoding: 1\r\n";
static const char ESP8266_FIREBASE_STR_34[] PROGMEM = "Connection: close\r\n";
static const char ESP8266_FIREBASE_STR_35[] PROGMEM = "Accept: text/event-stream\r\n";
static const char ESP8266_FIREBASE_STR_36[] PROGMEM = "Connection: keep-alive\r\n";
static const char ESP8266_FIREBASE_STR_37[] PROGMEM = "Keep-Alive: timeout=30, max=100\r\n";
static const char ESP8266_FIREBASE_STR_38[] PROGMEM = "Accept-Encoding: identity;q=1,chunked;q=0.1,*;q=0\r\n";
static const char ESP8266_FIREBASE_STR_39[] PROGMEM = "connection refused";
static const char ESP8266_FIREBASE_STR_40[] PROGMEM = "send header failed";
static const char ESP8266_FIREBASE_STR_41[] PROGMEM = "send payload failed";
static const char ESP8266_FIREBASE_STR_42[] PROGMEM = "not connected";
static const char ESP8266_FIREBASE_STR_43[] PROGMEM = "connection lost";
static const char ESP8266_FIREBASE_STR_44[] PROGMEM = "no HTTP server";
static const char ESP8266_FIREBASE_STR_45[] PROGMEM = "bad request";
static const char ESP8266_FIREBASE_STR_46[] PROGMEM = "non-authoriative information";
static const char ESP8266_FIREBASE_STR_47[] PROGMEM = "no content";
static const char ESP8266_FIREBASE_STR_48[] PROGMEM = "moved permanently";
static const char ESP8266_FIREBASE_STR_49[] PROGMEM = "use proxy";
static const char ESP8266_FIREBASE_STR_50[] PROGMEM = "temporary redirect";
static const char ESP8266_FIREBASE_STR_51[] PROGMEM = "permanent redirect";
static const char ESP8266_FIREBASE_STR_52[] PROGMEM = "unauthorized";
static const char ESP8266_FIREBASE_STR_53[] PROGMEM = "forbidden";
static const char ESP8266_FIREBASE_STR_54[] PROGMEM = "not found";
static const char ESP8266_FIREBASE_STR_55[] PROGMEM = "method not allow";
static const char ESP8266_FIREBASE_STR_56[] PROGMEM = "not acceptable";
static const char ESP8266_FIREBASE_STR_57[] PROGMEM = "proxy authentication required";
static const char ESP8266_FIREBASE_STR_58[] PROGMEM = "request timeout";
static const char ESP8266_FIREBASE_STR_59[] PROGMEM = "length required";
static const char ESP8266_FIREBASE_STR_60[] PROGMEM = "too many requests";
static const char ESP8266_FIREBASE_STR_61[] PROGMEM = "request header fields too larg";
static const char ESP8266_FIREBASE_STR_62[] PROGMEM = "internal server error";
static const char ESP8266_FIREBASE_STR_63[] PROGMEM = "bad gateway";
static const char ESP8266_FIREBASE_STR_64[] PROGMEM = "service unavailable";
static const char ESP8266_FIREBASE_STR_65[] PROGMEM = "gateway timeout";
static const char ESP8266_FIREBASE_STR_66[] PROGMEM = "http version not support";
static const char ESP8266_FIREBASE_STR_67[] PROGMEM = "network authentication required";
static const char ESP8266_FIREBASE_STR_68[] PROGMEM = "data buffer overflow";
static const char ESP8266_FIREBASE_STR_69[] PROGMEM = "read Timeout";
static const char ESP8266_FIREBASE_STR_70[] PROGMEM = "data type mismatch";
static const char ESP8266_FIREBASE_STR_71[] PROGMEM = "path not exist";
static const char ESP8266_FIREBASE_STR_72[] PROGMEM = "task";
static const char ESP8266_FIREBASE_STR_73[] PROGMEM = "/esp.32";
static const char ESP8266_FIREBASE_STR_74[] PROGMEM = "json";
static const char ESP8266_FIREBASE_STR_75[] PROGMEM = "string";
static const char ESP8266_FIREBASE_STR_76[] PROGMEM = "float";
static const char ESP8266_FIREBASE_STR_77[] PROGMEM = "int";
static const char ESP8266_FIREBASE_STR_78[] PROGMEM = "null";
static const char ESP8266_FIREBASE_STR_79[] PROGMEM = ";";
static const char ESP8266_FIREBASE_STR_80[] PROGMEM = "Content-Disposition: ";
static const char ESP8266_FIREBASE_STR_81[] PROGMEM = "application/octet-stream";
static const char ESP8266_FIREBASE_STR_82[] PROGMEM = "attachment";
static const char ESP8266_FIREBASE_STR_83[] PROGMEM = "Backup file was not exist";
static const char ESP8266_FIREBASE_STR_84[] PROGMEM = "SD card is in used";
static const char ESP8266_FIREBASE_STR_85[] PROGMEM = "SD card was not available";
static const char ESP8266_FIREBASE_STR_86[] PROGMEM = "Could not read/write backup file";
static const char ESP8266_FIREBASE_STR_87[] PROGMEM = "Transmission error, ";
static const char ESP8266_FIREBASE_STR_88[] PROGMEM = "Node path is not exist";
static const char ESP8266_FIREBASE_STR_89[] PROGMEM = ".json";
static const char ESP8266_FIREBASE_STR_90[] PROGMEM = "/root.json";
static const char ESP8266_FIREBASE_STR_91[] PROGMEM = "blob";
static const char ESP8266_FIREBASE_STR_92[] PROGMEM = "\"blob,base64,";
static const char ESP8266_FIREBASE_STR_93[] PROGMEM = "\"file,base64,";
static const char ESP8266_FIREBASE_STR_94[] PROGMEM = "http connection was used by other process";
static const char ESP8266_FIREBASE_STR_95[] PROGMEM = "Location: ";
static const char ESP8266_FIREBASE_STR_96[] PROGMEM = "&orderBy=";
static const char ESP8266_FIREBASE_STR_97[] PROGMEM = "&limitToFirst=";
static const char ESP8266_FIREBASE_STR_98[] PROGMEM = "&limitToLast=";
static const char ESP8266_FIREBASE_STR_99[] PROGMEM = "&startAt=";
static const char ESP8266_FIREBASE_STR_100[] PROGMEM = "&endAt=";
static const char ESP8266_FIREBASE_STR_101[] PROGMEM = "&equalTo=";
static const char ESP8266_FIREBASE_STR_102[] PROGMEM = "\"error\" : ";
static const char ESP8266_FIREBASE_STR_103[] PROGMEM = "/.settings/rules";
static const char ESP8266_FIREBASE_STR_104[] PROGMEM = "{\"status\":\"ok\"}";
static const char ESP8266_FIREBASE_STR_105[] PROGMEM = "boolean";
static const char ESP8266_FIREBASE_STR_106[] PROGMEM = "false";
static const char ESP8266_FIREBASE_STR_107[] PROGMEM = "true";
static const char ESP8266_FIREBASE_STR_108[] PROGMEM = "";
static const char ESP8266_FIREBASE_STR_109[] PROGMEM = "cancel";
static const char ESP8266_FIREBASE_STR_110[] PROGMEM = "auth_revoked";
static const char ESP8266_FIREBASE_STR_111[] PROGMEM = "http://";
static const char ESP8266_FIREBASE_STR_112[] PROGMEM = "https://";

static const unsigned char ESP8266_FIREBASE_base64_table[65] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";

class FirebaseData;
class StreamData;
class FirebaseESP8266;

class QueryFilter
{
public:
  QueryFilter();
  ~QueryFilter();
  void orderBy(const String &);
  void limitToFirst(int);
  void limitToLast(int);
  void startAt(int);
  void endAt(int);
  void startAt(const String &);
  void endAt(const String &);
  void equalTo(int);
  void equalTo(const String &);
  void clear();
  friend FirebaseESP8266;

protected:
  std::string _orderBy = "";
  std::string _limitToFirst = "";
  std::string _limitToLast = "";
  std::string _startAt = "";
  std::string _endAt = "";
  std::string _equalTo = "";
};

class FirebaseESP8266
{
public:
  struct FirebaseDataType;
  struct FirebaseMethod;

  FirebaseESP8266();
  ~FirebaseESP8266();

